Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: A new internal variable, C<${^CHILD_ERROR_NATIVE}>, gives the native status returned by the last pipe close, backtick command, successful call to wait() or waitpid(), or from the system() operator.
es_es: Una nueva variable interna, C<${^CHILD_ERROR_NATIVE}>, indica el estado nativo devuelto por la última tubería cerrada, comando con acento grave, llamada exitosa a wait() o waitpid(), o desde el operador system().

source: C<for (reverse @foo)> now iterates in reverse, avoiding the generation of a temporary reversed list.
es_es: C<for (reverse @foo)> ahora se repite a la inversa, evitando la generación de una lista invertida temporal.

source: Compare with L</require>, which can do a similar check at run time.
es_es: Compare con L</require>, que puede hacer un control similar en tiempo de ejecución.

source: This bug fix may cause some programs to start correctly issuing warnings.
es_es: Esta corrección de error puede causar que algunos programas inicien, de forma correcta, la emisión de advertencias.

source: C<croak()> only when your module absolutely cannot figure out what to do.
es_es: C<croak()> solo cuando el módulo no puede averiguar, de forma absoluta, qué debe de hacer.

source: $+{foo} will be the same as $2, and $3 will contain 'z' instead of the opposite which is what a .NET regex hacker might expect.
es_es: $+{foo} será lo mismo que $2, y $3 contendrá 'z' en lugar de lo opuesto que un hacker en regex .NET podría esperar.

source: If the two digests match, the password is correct.
es_es: Si los dos I<digest> coinciden, la contraseña es correcta.

source: If the first character after the "[" is "^", the class matches any character not in the list.
es_es: Si el primer carácter después del "[" es "^", la clase coincide con cualquier carácter que no esté en la lista.

source: To set your private value, call C<Perl_mro_set_private_data()>:
es_es: Para establecer el valor privado, llame a C<Perl_mro_set_private_data()>:

source: $biz = "$foo" ^ "$bar"; # both ops explicitly stringy
es_es: $biz = "$foo" ^ "$bar"; # ambas op. explícitamente como literales

source: I didn't dare yet to try enabling it and see what problems occur.
es_es: No me atrevía aún a activarlo y ver qué problemas pueden ocurrir.

source: See L</Extended Patterns> below for details.
es_es: Vea más abajo L</Patrones extendidos> para más detalles.

source: # poor man's grep
es_es: # un grep para pobres

source: C<binmode>, C<close>, C<closedir>, C<dbmclose>, C<dbmopen>, C<die>, C<eof>, C<fileno>, C<flock>, C<format>, C<getc>, C<print>, C<printf>, C<read>, C<readdir>, C<rewinddir>, C<say>, C<seek>, C<seekdir>, C<select>, C<syscall>, C<sysread>, C<sysseek>, C<syswrite>, C<tell>, C<telldir>, C<truncate>, C<warn>, C<write>
es_es: C<binmode>, C<close>, C<closedir>, C<dbmclose>, C<dbmopen>, C<die>, C<eof>, C<fileno>, C<flock>, C<format>, C<getc>, C<print>, C<printf>, C<read>, C<readdir>, C<rewinddir>, C<seek>, C<seekdir>, C<select>, C<syscall>, C<sysread>, C<sysseek>, C<syswrite>, C<tell>, C<telldir>, C<truncate>, C<warn>, C<write>

source: =head2 The Filter
es_es: =head2 El filtro

source: Thanks to Hannu Napari <Hannu.Napari@hut.fi> for the IRIX
es_es: Gracias a Hannu Napari <Hannu.Napari@hut.fi> por la información

source: is equivalent to
es_es: es equivalente a

source: $width = 2**$w;
es_es: $ancho = 2**$w;

source: =cut back
es_es: =cut regreso

source: This document describes differences between the 5.8.7 release and the 5.8.8 release.
es_es: Este documento describe las diferencias entre la versión 5.8.7 y la versión 5.8.8.

source: arrayref ${$$foo[1]}[2] aka $foo->[1]->[2]
es_es: anónimo ${$$foo[1]}[2] equivale a $foo->[1]->[2]

source: For example, without internal optimizations done by the regular expression engine, this will take a painfully long time to run:
es_es: Por ejemplo, sin optimizaciones internas realizadas por el motor de expresiones regulares, esto tomará un tiempo dolorosamente largo:

source: Within a list, the "-" character specifies a range, so that C<a-z> represents all characters between "a" and "z", inclusive.
es_es: Dentro de una lista, el carácter "-" indica un intervalo, de modo que C<a-z> representa todos los caracteres entre "a" y "z", ambos inclusive.

source: Recursing deeper than 50 times without consuming any input string will result in a fatal error.
es_es: Realizar un proceso recursivo más de 50 veces sin consumir ninguna cadena de entrada resultará en un error fatal.

source: Another common way to create a similar cycle is with the looping modifier C<//g>:
es_es: Otra forma común de crear un ciclo similar es con el modificador de bucle C<//g>:

source: The following shows how using negative indexing can make it easier to embed recursive patterns inside of a C<qr//> construct for later use:
es_es: A continuación se muestra cómo el uso de indexación negativa puede hacer que sea más fácil de integrar dentro de los patrones recurrentes de una construcción C<qr//> para su uso posterior:

source: foreach $file (sort keys(%seen)) {
es_es: foreach $archivo (sort keys(%visto)) {

source: say "a*b is ", $a*$b;
es_es: say "a*b es ", $a*$b;

source: Formerly, the indices passed to C<FETCH>, C<STORE>, C<EXISTS>, and C<DELETE> methods in tied array class were always non-negative.
es_es: Anteriormente, los índices que se pasaban a los métodos C<FETCH>, C<STORE>, C<EXISTS>, y C<DELETE> de la clase array enlazada eran siempre no negativos.

source: @fields = split(/\b(?:a|b|c)\b/)
es_es: @campos = split(/\b(?:a|b|c)\b/)

source: See the platform-specific release notes for more details about your particular environment.
es_es: Vea las notas específicas de la plataforma para obtener más detalles acerca de su entorno particular.

source: The package in which the variable is entered is determined at the point of the declaration, not at the point of use.
es_es: El paquete en el que se introduce la variable se determina en el punto de la declaración, no en el momento de ser usada.

source: However, if you were to declare the subroutine as C<sub myname ($)>, then C<myname> would function as a unary operator, so either C<or> or C<||> would work.
es_es: Sin embargo, si declara la subrutina como C<sub minombre ($)>, entonces C<minombre> funcionará como un operador unario, así que servirán tanto C<or> como C<||>.

source: If there is a C<continue> BLOCK attached to a BLOCK (typically in a C<while> or C<foreach>), it is always executed just before the conditional is about to be evaluated again, just like the third part of a C<for> loop in C. Thus it can be used to increment a loop variable, even when the loop has been continued via the C<next> statement (which is similar to the C C<continue> statement).
es_es: Si existe un BLOQUE C<continue> adjunto a un BLOQUE (típicamente en un C<while> o C<foreach>), siempre es ejecutado justo antes de que la condicional sea de nuevo evaluada, igual que la tercera parte de un bucle C<for> en C. Esto puede ser utilizado para incrementar una variable de bucle, incluso cuando el bucle ha sido interrumpido por la instrucción C<next> (que es similar a la instrucción C<continue> del C).

source: All this is experimental.
es_es: Todo esto es experimental.

source: This tries to minimally patch the uconfig.sh using your *current* Perl so that your microperl has the correct basic types and sizes and byteorder.
es_es: Esto intenta parchear mínimamente el uconfig.sh utilizando su *actual* Perl para que su microperl tenga los tipos y tamaños básicos y orden de los bytes correcto.

source: Strings that match parenthesized parts of a regular expression are saved under names containing only digits after the C<$> (see L<perlop> and L<perlre>).
es_es: Las cadenas que coinciden con las partes encerradas entre paréntesis de una expresión regular se guardan con nombres que contienen sólo dígitos después del C<$> (vea L<perlre> y L<perlop>).

source: Regexp-like quote.
es_es: Entrecomillado de expresión regular.

source: printf "File is %s, size is %s, perm %04o, mtime %s\n", $filename, $sb->size, $sb->mode & 07777, scalar localtime $sb->mtime;
es_es: printf "Archivo es %s, tamaño es %s, perm %04o, mtime %s\n", $archivo, $sb->size, $sb->mode & 07777, scalar localtime $sb->mtime;

source: For numeric conversions, you can specify the size to interpret the number as using C<l>, C<h>, C<V>, C<q>, C<L>, or C<ll>.
es_es: Para conversiones numéricas, se puede especificar el tamaño del número a interpretar usando C<l>, C<h>, C<V>, C<q>, C<L>, o C<ll>.

source: Ponie stands for "Perl On the New Internal Engine", started by Arthur Bergman from Fotango in 2003, and subsequently run as a project of The Perl Foundation.
es_es: Ponie significa "Perl On the New Internal Engine" (Perl en el nuevo motor interno). Este proyecto lo inició Arthur Bergman (de Fotango) en 2003, y posteriormente lo adoptó The Perl Foundation.

source: You cannot use this for look-behind.
es_es: No puede usar esto para las búsquedas antecedentes.

source: Replace C</path/to/flock/server/headers> with the path to the directory containing the C<flock.h> header.
es_es: Reemplace C</ruta/a/cabeceras/servidor/flock> con la ruta al directorio que contiene la cabecera C<flock.h>.

source: Changes the access and modification times on each file of a list of files.
es_es: Cambia los tiempos de acceso y modificación de cada archivo de una lista de archivos.

source: last if /fred/;
es_es: last if /pedro/;

source: Saying C<-exp($foo)> still works as expected, however: only single letters following a minus are interpreted as file tests.
es_es: Decir C<-exp($foo)> sigue funcionando como se espera que lo haga: sólo letras sueltas, por detrás de un menos, son interpretadas como test de archivos.

source: use v5.14; # using the + prototype, new to v5.14
es_es: use v5.14; # usando el prototipo +, nuevo en v5.14

source: =head2 Configure Perl on VM/ESA
es_es: =head2 Configurar Perl en VM/ESA

source: my $patterns = shift;
es_es: my $patrones = shift;

source: than
es_es: que

source: C<foreach> on threads::shared array used to be able to crash Perl.
es_es: C<foreach> sobre un array threads::shared era capaz de colgar Perl.

source: =head2 The C<feature> pragma
es_es: =head2 El pragma C<feature>

source: C<IPC::Open2> upgraded to version 1.02
es_es: C<IPC::Open2> actualizado a la versión 1.02

source: At the cost of some space and considerable speed, they avoid the normal pitfalls associated with limited-precision representations.
es_es: A costa de algún espacio y velocidad, evitan los peligros asociados a la limitada precisión de las representaciones.

source: p A pointer to a null-terminated string.
es_es: p Un puntero a una cadena terminada en nulo.

source: For example, to grab non-empty comments into $1, one should use either one of these:
es_es: Por ejemplo, para capturar la parte no vacía de los comentarios, en $1, debería usar uno de estos patrones:

source: It's an alternative to C<make test>.
es_es: Es una alternativa a C<make test>.

source: (foo|bar|baz) matches any of the alternatives specified
es_es: (foo|bar|baz) cualquiera de las alternativas especificadas

source: You may embed this Package's interpreter within an executable of yours (by linking); this shall be construed as a mere form of aggregation, provided that the complete Standard Version of the interpreter is so embedded.
es_es: Usted puede integrar el intérprete de este Paquete dentro de un ejecutable suyo (mediante montaje o linkado); esto se entenderá como una mera forma de agregación, siempre que la Versión Estándar completa del intérprete esté empotrada.

source: On the EBCDIC platforms that Perl handles, the native character set is equivalent to Latin-1.
es_es: En las plataformas EBCDIC que maneja Perl, el conjunto de caracteres nativo, es equivalente a Latin-1.

source: On many Unix systems, fdopen() is known to fail when file descriptors exceed a certain value, typically 255.
es_es: En muchos sistemas Unix, fdopen() se conoce que falla cuando los descriptores de archivo exceden un valor determinado, por lo general 255.

source: Then, in the source to be cross compiled:
es_es: Luego, en el código fuente para ser compilado de forma cruzada:

source: The perl5 development team are implementing changes to help address this problem, which should go live in early 2004.
es_es: El equipo de desarrollo de perl5 está implementando cambios para ayudar a resolver este problema, que debería aparecer a principios de 2004.

source: =item flip-flop operators
es_es: =item Operadores flip-flop

source: Note that in the latter case, it is usually highly counter-productive to declare $a and $b as lexicals.
es_es: Tenga en cuenta que en el último caso, suele ser altamente contraproducente declarar $a y $b como léxicas.

source: Attempts to read LENGTH bytes of data into variable SCALAR from the specified FILEHANDLE, using the read(2).
es_es: Intenta leer LONGITUD bytes de datos en la variable ESCALAR desde el IDENTIFICADOR_ARCHIVO especificado, utilizando read(2).

source: In the book, Randal Schwartz capitalised the language's name to make it stand out better when typeset.
es_es: En el libro, Randal Schwartz escribió el nombre del lenguaje con inicial mayúscula para que destacara mejor en la composición tipográfica.

source: =item unshift ARRAY,LIST X<unshift>
es_es: =item unshift ARRAY,LISTA X<unshift>

source: (We try not to do this more than we have to.)
es_es: (Tratamos de no hacer esto no más de lo necesario).

source: See the list of operators in the next section for information on comparison and boolean logic operators, which are commonly used in conditional statements.
es_es: Consulte la lista de operadores de la siguiente sección para obtener información sobre los operadores lógicos booleanos y de comparación que se suelen usar en instrucciones condicionales.

source: produces the list value
es_es: produce la lista de valores

source: =head2 New "Pseudo-hashes are deprecated"
es_es: =head2 Nuevo "Pseudo-hashes are deprecated"

source: Breaks the binding between a variable and a package.
es_es: Rompe el enlace entre una variable y un paquete.

source: or spaced out a bit:
es_es: o un poco más espaciado:

source: local $/; # slurp!
es_es: local $/; # ¡sorber!

source: "" qq{} Literal yes
es_es: "" qq{} Literal sí

source: Encodes to a character in character mode
es_es: Codifica a un carácter en modo de caracteres

source: the differences being that it generates a real list at compile time, and in scalar context it returns the last element in the list.
es_es: siendo diferente en que genera una lista real en tiempo de compilación, y en contexto escalar devuelve el último elemento de la lista.

source: C<if> executes the statement once I<if> and only if the condition is true.
es_es: C<if> ejecuta la instrucción una vez I<si> y sólo si la condición es verdadera.

source: $b> will now work as expected when either $a or $b is C<undef>
es_es: $b> ahora funcionará como se espera cuando $a o $b sean C<undef>

source: =head2 A proper interface for pluggable Method Resolution Orders
es_es: =head2 Una interfaz adecuada para un Método de Resolución de Órdenes

source: perl5121delta Perl changes in version 5.12.1
es_es: perl5121delta Cambios en la versión 5.12.1

source: which enables a switch feature that is closely based on the Perl 6 proposal.
es_es: que activa la característica conmutador, que se basa estrechamente en la propuesta en Perl 6.

source: As it happens, using C<@array> where Perl expects to find a scalar value ("in scalar context") will give you the number of elements in the array:
es_es: Si utiliza C<@array> donde Perl espera encontrar un valor escalar ("en contexto escalar"), obtendrá el número de elementos del array:

source: If your routine changes its behaviour significantly based on its arguments, it's a sign that you should have two (or more) separate routines.
es_es: Si su rutina cambia su comportamiento de manera significativa sobre la base de sus argumentos, es una señal de que debe tener dos (o más) rutinas separadas.

source: In other words, it does not check the full recursion stack.
es_es: En otras palabras, no comprueba la pila completa de la recursión.

source: left &
es_es: izquierda &

source: Leading whitespace is not stripped, unlike oct().
es_es: Espacios en blanco aledaños, no son eliminados, a diferencia de oct().

source: The exact behaviour may change in a future version of Perl.
es_es: El comportamiento exacto puede cambiar en una futura versión de Perl.

source: produces the output 'h:i: :t:h:e:r:e'.
es_es: produce la salida 'h:o:l:a: :p:o:r: :a:q:u:i'.

source: undef @ARRAY; # forget @ARRAY ever existed
es_es: undef @ARRAY; # hacer que @ARRAY nunca existió

source: perlmodstyle Perl modules: how to write modules with style
es_es: perlmodstyle Cómo programar módulos Perl con estilo

source: (There is a Perl script called B<h2ph> that comes with the Perl kit that may help you in this, but it's nontrivial.) SCALAR will be read and/or written depending on the FUNCTION; a C pointer to the string value of SCALAR will be passed as the third argument of the actual C<ioctl> call.
es_es: (Existe un script Perl llamado B<h2ph> que viene con el kit Perl que puede ayudarle en esto, pero no es nada trivial). ESCALAR será leído o escrito dependiendo de la FUNCIÓN; un puntero C al valor de la cadena ESCALAR será pasado como tercer argumento de la actual llamada C<ioctl>.

source: We've already seen how to print to standard output using C<print()>.
es_es: Ya hemos visto la manera de imprimir en la salida estándar mediante C<print()>.

source: As a special case the three-argument form with a read/write mode and the third argument being C<undef>:
es_es: Como un caso especial, la forma de tres argumentos con un modo de lectura/escritura y el tercer argumento siendo C<undef>:

source: # am the parent:
es_es: # soy el padre:

source: Subroutine references are the simplest case.
es_es: Referencias a subrutinas son el caso más simple.

source: You must yourself do any alignment or padding by inserting, for example, enough C<"x">es while packing.
es_es: Debe hacer cualquier alineamiento o rellenado, insertando, por ejemplo, suficientes C<"x">, mientras desempaqueta.

source: =item "Freely Available"
es_es: =item "Libre Disponibilidad"

source: We will call this syntactic construct a BLOCK.
es_es: Llamaremos a esta construcción sintáctica un BLOQUE.

source: You may still see C<require 'syscall.ph'> or similar around - the F<.ph> file should be created by running F<h2ph> on the corresponding F<.h> file.
es_es: Es posible que se encuentre código en el que se usa C<require 'syscall.ph'> o algo similar; para crear el archivo F<.ph> se debe ejecutar F<h2ph> en el archivo F<.h> correspondiente.

source: Because print takes a LIST, anything in the LIST is evaluated in list context, including any subroutines whose return lists you pass to C<print>.
es_es: Debido a que print toma una LISTA, cualquier cosa en la LISTA es evaluada en contexto de lista, incluyendo cualquier subrutina que devuelva listas.

source: =head3 Assertions
es_es: =head3 Aserciones

source: \g{name} [5] Named backreference
es_es: \g{name} [5] Contrareferencia nominal

source: =item ioctl FILEHANDLE,FUNCTION,SCALAR
es_es: =item ioctl IDENTIFICADOR_ARCHIVO,FUNCIÓN,ESCALAR

source: A (file)glob evaluates its (embedded) argument only when it is starting a new list.
es_es: Una expansión evalúa sus argumentos (incorporados) sólo cuando está iniciando una nueva lista.

source: In the absence of parentheses, the precedence of list operators such as C<print>, C<sort>, or C<chmod> is either very high or very low depending on whether you are looking at the left side or the right side of the operator.
es_es: En ausencia de paréntesis, la precedencia de los operadores de lista como C<print>, C<sort>, o C<chmod> es, o muy alta o muy baja, dependiendo de si usted está mirando al lado izquierdo o al lado derecho del operador.

source: details).
es_es: detalles).

source: If the current package has a subroutine named C<ToLower>, it will be used to change the case (See L<perlunicode/"User-Defined Case Mappings (for serious hackers only)">.) Otherwise Unicode semantics are used for the case change.
es_es: Si el paquete actual tiene un subrutina denominada C<ToLower>, será utilizada para cambiar el tamaño de caja (ver L<perlunicode/Mapeos de caja definidos por el usuario (solo para hackers serios)>). De lo contrario se utiliza la semántica Unicode para el cambio de tamaño de caja.

source: Some operators return the length of the list that would have been returned in list context.
es_es: Algunos operadores devuelven la longitud de la lista que se hubiera devuelto en contexto lista.

source: C<until> does the opposite, it repeats the statement I<until> the condition is true (or while the condition is false):
es_es: C<until> hace lo opuesto, repite la instrucción I<hasta> que la condición sea verdadera (o mientras la condición sea falsa):

source: It also differs in that code evaluated with C<do FILENAME> cannot see lexicals in the enclosing scope; C<eval STRING> does.
es_es: También difiere en que el código evaluado con C<do NOMBREARCHIVO> no puede ver a las variables léxicas en el ámbito en que se ejecuta; C<eval STRING> sí.

source: Interpreter initialization is more complete when -DMULTIPLICITY is off.
es_es: El Intérprete de inicialización es más completo cuando -DMULTIPLICITY está desactivado.

source: C<perlcc -B> works now at least somewhat better, while C<perlcc -c> is rather more broken.
es_es: C<perlcc -B> trabaja ahora por lo menos un poco mejor, mientras que C<perlcc -c> está algo más roto.

source: This is a string.
es_es: Esto es una cadena.

source: The best way to build a Perl for PASE is to use an AIX host as a cross-compilation environment.
es_es: La mejor manera de construir un Perl para PASE es utilizar un host AIX como entorno de compilación cruzado.

source: $uid = getpwnam($name);
es_es: $uid = getpwnam($nombre);

source: =item import LIST X<import>
es_es: =item import LISTA X<import>

source: Several memory leaks in ithreads were closed.
es_es: Varias fugas de memoria en ithreads fueron cerradas.

source: =item chop( LIST )
es_es: =item chop( LISTA )

source: In our example, C<$myarray[-1]> would have been 5000, and C<$myarray[-2]> would have been 500.
es_es: En nuestro ejemplo, C<$miarray[-1]> habría sido 5000, y C<$miarray[-2]> habría sido 500.

source: UTF-8 length and position cache: to speed up the handling of Unicode (UTF-8) scalars, a cache was introduced.
es_es: Longitud y posición de la caché UTF-8: para acelerar la tramitación de escalares Unicode (UTF-8), se introdujo una memoria caché.

source: printf '<%.*x>', 6, 1; # prints "<000001>"
es_es: printf '<%.*x>', 6, 1; # imprime "<000001>"

source: That doesn't mean you should go out of your way to avoid backticks when they're the right way to get something done.
es_es: Eso no significa que deba evitar las comillas invertidas cuando sea la forma correcta de hacer algo.

source: The operator is bistable, like a flip-flop, and emulates the line-range (comma) operator of B<sed>, B<awk>, and various editors.
es_es: El operador es biestable, como un flip-flop, y emula el operador rango-de-línea de B<sed>, B<awk>, y diversos editores.

source: Instead, use C<\034> or C<\x1c> at the end of quoted constructs.
es_es: En su lugar, utilice C<\034> o C<\x1c> al final de la construcción entrecomillada.

source: 2: got ABC
es_es: 2: tenemos ABC
